; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v13 ?v12)
             (pred_3 ?v10 ?v4)
             (pred_12 ?v13 ?v4)
             (pred_8 ?v11 ?v13 )
	     (pred_1 ?v13)
             (pred_10 ?v7)
             (pred_5 ?v10)
             (pred_6 ?v4)
             (pred_9 ?v13)
             (pred_7 ?v10)
             (pred_4 ?v13)
             (pred_11 ))



(:action op_4
:parameters (?v9 ?v8 ?v1 ?v5)
:precondition (and (pred_10 ?v9) (pred_10 ?v8) (pred_5 ?v1) (pred_6 ?v5)
          (pred_2 ?v9 ?v8) (pred_3 ?v1 ?v5)
                   (pred_12 ?v8 ?v5) (pred_1 ?v9) 
                   (pred_9 ?v8) (pred_7 ?v1))
:effect (and  (pred_4 ?v8) (not (pred_9 ?v8))))


(:action op_5
:parameters (?v9 ?v6)
:precondition (and (pred_10 ?v9) (pred_10 ?v6)
               (pred_1 ?v9) (pred_2 ?v9 ?v6) (pred_4 ?v6))
:effect (and (pred_1 ?v6) (not (pred_1 ?v9))))

(:action op_2
:parameters (?v9 ?v1)
:precondition (and (pred_10 ?v9) (pred_5 ?v1) 
                  (pred_1 ?v9) (pred_8 ?v1 ?v9) (pred_11 ))
:effect (and (pred_7 ?v1)
   (not (pred_8 ?v1 ?v9)) (not (pred_11 ))))


(:action op_3
:parameters (?v9 ?v2 ?v3)
:precondition (and (pred_10 ?v9) (pred_5 ?v2) (pred_5 ?v3)
                  (pred_1 ?v9) (pred_7 ?v3) (pred_8 ?v2 ?v9))
:effect (and (pred_7 ?v2) (pred_8 ?v3 ?v9)
        (not (pred_7 ?v3)) (not (pred_8 ?v2 ?v9))))

(:action op_1
:parameters (?v9 ?v1)
:precondition (and (pred_10 ?v9) (pred_5 ?v1) 
                  (pred_1 ?v9) (pred_7 ?v1))
:effect (and (pred_11 ) (pred_8 ?v1 ?v9) (not (pred_7 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_15 obj_07 obj_01 obj_02 obj_16 obj_05 obj_04 obj_14 obj_06 obj_09 obj_17 obj_19 obj_10 obj_03 obj_13 obj_11
    obj_18 obj_08
    obj_12 obj_20
    )

    (:init
       (pred_11)

       (pred_10 obj_15)
       (pred_10 obj_07)
       (pred_10 obj_01)
       (pred_10 obj_02)
       (pred_10 obj_16)
       (pred_10 obj_05)
       (pred_10 obj_04)
       (pred_10 obj_14)
       (pred_10 obj_06)
       (pred_10 obj_09)
       (pred_10 obj_17)
       (pred_10 obj_19)
       (pred_10 obj_10)
       (pred_10 obj_03)
       (pred_10 obj_13)
       (pred_10 obj_11)
       (pred_6 obj_18)
       (pred_6 obj_08)
       (pred_5 obj_12)
       (pred_5 obj_20)

       (pred_2 obj_15 obj_16)
       (pred_2 obj_15 obj_07)
       (pred_2 obj_07 obj_05)
       (pred_2 obj_07 obj_01)
       (pred_2 obj_07 obj_15)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_01 obj_07)
       (pred_2 obj_02 obj_14)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_16 obj_06)
       (pred_2 obj_16 obj_05)
       (pred_2 obj_16 obj_15)
       (pred_2 obj_05 obj_09)
       (pred_2 obj_05 obj_04)
       (pred_2 obj_05 obj_07)
       (pred_2 obj_05 obj_16)
       (pred_2 obj_04 obj_17)
       (pred_2 obj_04 obj_14)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_04 obj_05)
       (pred_2 obj_14 obj_19)
       (pred_2 obj_14 obj_02)
       (pred_2 obj_14 obj_04)
       (pred_2 obj_06 obj_10)
       (pred_2 obj_06 obj_09)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_09 obj_03)
       (pred_2 obj_09 obj_17)
       (pred_2 obj_09 obj_05)
       (pred_2 obj_09 obj_06)
       (pred_2 obj_17 obj_13)
       (pred_2 obj_17 obj_19)
       (pred_2 obj_17 obj_04)
       (pred_2 obj_17 obj_09)
       (pred_2 obj_19 obj_11)
       (pred_2 obj_19 obj_14)
       (pred_2 obj_19 obj_17)
       (pred_2 obj_10 obj_03)
       (pred_2 obj_10 obj_06)
       (pred_2 obj_03 obj_13)
       (pred_2 obj_03 obj_09)
       (pred_2 obj_03 obj_10)
       (pred_2 obj_13 obj_11)
       (pred_2 obj_13 obj_17)
       (pred_2 obj_13 obj_03)
       (pred_2 obj_11 obj_19)
       (pred_2 obj_11 obj_13)
       (pred_9 obj_03)
       (pred_9 obj_01)
       (pred_12  obj_03 obj_18)
       (pred_12  obj_01 obj_08)
       (pred_4 obj_15)
       (pred_4 obj_07)
       (pred_4 obj_02)
       (pred_4 obj_16)
       (pred_4 obj_05)
       (pred_4 obj_04)
       (pred_4 obj_14)
       (pred_4 obj_06)
       (pred_4 obj_09)
       (pred_4 obj_17)
       (pred_4 obj_19)
       (pred_4 obj_10)
       (pred_4 obj_13)
       (pred_4 obj_11)

       (pred_3  obj_12 obj_18)
       (pred_3  obj_20 obj_08)
       (pred_8 obj_12 obj_07)
       (pred_8 obj_20 obj_06)
       (pred_1 obj_05)
    )

    (:goal (and
       (pred_8 obj_12 obj_11)
    ))
(:constraints
  (always (not (pred_1 obj_04)))
)
)

; plan
1. (op_5 obj_05 obj_07)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_07)
   goals met: 0 of 1
2. (op_2 obj_07 obj_12)
   deleted: (pred_8 obj_12 obj_07) (pred_11)
   added: (pred_7 obj_12)
   goals met: 0 of 1
3. (op_5 obj_07 obj_05)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_05)
   goals met: 0 of 1
4. (op_5 obj_05 obj_09)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_09)
   goals met: 0 of 1
5. (op_5 obj_09 obj_17)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_17)
   goals met: 0 of 1
6. (op_5 obj_17 obj_19)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_19)
   goals met: 0 of 1
7. (op_5 obj_19 obj_11)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_11)
   goals met: 0 of 1
8. (op_1 obj_11 obj_12)
   deleted: (pred_7 obj_12)
   added: (pred_11) (pred_8 obj_12 obj_11)
   goals met: 1 of 1
